import time
import platform
import os
import socket
from requests import get

def exit_program():
    print('Выход...')
    time.sleep(1.0)
    exit()

def menu():
    options = {
        'взлом жопы': system_shutdown,
        'о системе': all_about_platform,
        'мой ip': IP,
        'выход': exit_program
    }
    print('')
    user_command = input('''О системе/Мой IP/Взлом жопы/Выход
    \n''').lower()
    print('')
    options.get(user_command, lambda: error())()

def error():
    print('Неизвестная команда.')
    menu()

def IP():
    global hostname
    hostname = socket.gethostname()
    global local_ip
    local_ip = socket.gethostbyname(hostname)
    global public_ip
    public_ip = get('http://api.ipify.org').text
    print('Имя в сети: ' + hostname)
    print('Локальный IP (IPv4): ' + local_ip)
    print('Публичный IP: ' + public_ip)
    menu()

def all_about_platform():
    print('Имя пользователя: ' + platform.node())
    print('Имя в сети: ' + platform.node())
    print('ОС: ' + platform.system() + ' ' + platform.release())
    print('Версия: ' + platform.version())
    print('Тип машины: ' + platform.machine())
    print('Семейство процессора: ' + platform.processor())
    menu()

def system_shutdown():
      num = 5
      for i in range(0, 6):
            print('Взлом жопы через... ' + str(num))
            num = num - 1
            time.sleep(1.0)
      time.sleep(1.0)
      print('''
███████▓█████▓▓╬╬╬╬╬╬╬╬▓███▓╬╬╬╬╬╬╬▓╬╬▓█
████▓▓▓▓╬╬▓█████╬╬╬╬╬╬███▓╬╬╬╬╬╬╬╬╬╬╬╬╬█
███▓▓▓▓╬╬╬╬╬╬▓██╬╬╬╬╬╬▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
████▓▓▓╬╬╬╬╬╬╬▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
███▓█▓███████▓▓███▓╬╬╬╬╬╬▓███████▓╬╬╬╬▓█
████████████████▓█▓╬╬╬╬╬▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬█
███▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
████▓▓▓▓▓▓▓▓▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
███▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
█████▓▓▓▓▓▓▓▓█▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
█████▓▓▓▓▓▓▓██▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
█████▓▓▓▓▓████▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
████▓█▓▓▓▓██▓▓▓▓██╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
████▓▓███▓▓▓▓▓▓▓██▓╬╬╬╬╬╬╬╬╬╬╬╬█▓╬▓╬╬▓██
█████▓███▓▓▓▓▓▓▓▓████▓▓╬╬╬╬╬╬╬█▓╬╬╬╬╬▓██
█████▓▓█▓███▓▓▓████╬▓█▓▓╬╬╬▓▓█▓╬╬╬╬╬╬███
██████▓██▓███████▓╬╬╬▓▓╬▓▓██▓╬╬╬╬╬╬╬▓███
███████▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬████
███████▓▓██▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓████
████████▓▓▓█████▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█████
█████████▓▓▓█▓▓▓▓▓███▓╬╬╬╬╬╬╬╬╬╬╬▓██████
██████████▓▓▓█▓▓▓▓▓██╬╬╬╬╬╬╬╬╬╬╬▓███████
███████████▓▓█▓▓▓▓███▓╬╬╬╬╬╬╬╬╬▓████████
██████████████▓▓▓███▓▓╬╬╬╬╬╬╬╬██████████
███████████████▓▓▓██▓▓╬╬╬╬╬╬▓███████████''')
      print('')
      print('СПОКОЙНОЙ НОЧИ')
      time.sleep(3.0)
      os.system('shutdown /s /t 1')

print('''
██████╗░░█████╗░███╗░░░███╗███████╗░█████╗░  ░█████╗░░░░██████╗░
██╔══██╗██╔══██╗████╗░████║██╔════╝██╔══██╗  ██╔══██╗░░░╚════██╗
██████╔╝██║░░██║██╔████╔██║█████╗░░██║░░██║  ██║░░██║░░░░░███╔═╝
██╔══██╗██║░░██║██║╚██╔╝██║██╔══╝░░██║░░██║  ██║░░██║░░░██╔══╝░░
██║░░██║╚█████╔╝██║░╚═╝░██║███████╗╚█████╔╝  ╚█████╔╝██╗███████╗
╚═╝░░╚═╝░╚════╝░╚═╝░░░░░╚═╝╚══════╝░╚════╝░  ░╚════╝░╚═╝╚══════╝''')

menu()
